---
kind: other
id: Properties.T:Autodesk.Revit.DB.AssemblyDifference
source: html/a8d32abe-3192-f300-7c97-8af150156700.htm
---
# AssemblyDifference Properties

Specifies whether the .NET object represents a valid Revit entity.